# Екипът на СофтУни си организира футболен турнир.
# Първоначално прочитаме от конзолата капацитета на стадиона и броят на всички фенове.
# След това за всеки фен се чете секторът, в който се намира.
# Феновете на първия отбор са в сектор А и Б, а на втория – В и Г.
# Да се напише програма, която изчислява процентите на феновете във всеки сектор,
# спрямо общия брой фенове на стадиона, както и общият процент на феновете за двата отбора,
# спрямо капацитета на стадиона. Общият брой на феновете НЕ надвишава капацитета на стадиона.
# Вход
# От конзолата се четат поредица от числа, всяко на отделен ред:
# Капацитетът на стадиона – цяло число в интервала [1 … 10000];
# Броят на всички фенове – цяло число в интервала [1 … 10000].
# За всеки един фен, на отделен ред се прочита:
# Секторът, на който се намира – текст – "A", "B", "V" и "G".
# Изход
# Да се отпечатат на конзолата 5 реда, всеки от които съдържа процент между 0.00% и 100.00%, форматирани до втората цифра след десетичната запетая:
# Процентът на феновете в сектор А
# Процентът на феновете в сектор Б
# Процентът на феновете в сектор В
# Процентът на феновете в сектор Г
# Процентът на всички фенове, спрямо капацитета на стадиона.

a = 0
b = 0
v = 0
g = 0
stadium_capacity = int(input())
fan_number = int(input())
for i in range(fan_number):
    sector = str(input())
    if sector == "A":
        a += 1
    if sector == "B":
        b += 1
    if sector == "V":
        v += 1
    if sector == "G":
        g += 1

total_sector = a + b + v + g

print(f"{a / total_sector * 100:.2f}%")
print(f"{b / total_sector * 100:.2f}%")
print(f"{v / total_sector * 100:.2f}%")
print(f"{g / total_sector * 100:.2f}%")
print(f"{total_sector / stadium_capacity * 100:.2f}%")