# Напишете програма, която изчислява каква сума ще получите в края на депозитния период при определен лихвен процент. Използвайте следната формула:
# сума = депозирана сума  + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)
# Вход
# От конзолата се четат 3 реда:
# ⦁	Депозирана сума – реално число в интервала [100.00 … 10000.00]
# ⦁	Срок на депозита (в месеци) – цяло число в интервала [1…12]
# ⦁	Годишен лихвен процент – реално число в интервала [0.00 …100.00]
# Изход
# Да се отпечата на конзолата сумата в края на срока.

deposit_value = float(input())
deposit_period = int(input())
interest_percentage = float(input())

end_value = deposit_value + deposit_period * ((deposit_value * interest_percentage / 100) / 12)
print(end_value)