# Да се напише програма, която чете 2 * n-на брой цели числа,
# подадени от потребителя, и проверява дали
# сумата на първите n числа (лява сума) е равна
# на сумата на вторите n числа (дясна сума).
# При равенство печата " Yes, sum = " + сумата;
# иначе печата " No, diff = " + разликата.
# Разликата се изчислява като положително число (по абсолютна стойност).

n1= int(input())
n2 = 0
n22 = 0

for i in range(n1):
    n3 = int(input())
    n2 += n3

for i in range(n1):
    n33 = int(input())
    n22 += n33

if n2 == n22:
    print(f"Yes, sum = {n22}")
else:
    print(f"No, diff = {abs(n2 - n22)}")