# Григор Димитров е тенисист, чиято следваща цел е изкачването в световната ранглиста по тенис за мъже.
# През годината Гришо участва в определен брой турнири, като за всеки турнир получава точки, които зависят от позицията, на която е завършил в турнира. Има три варианта за завършване на турнир:
# ⦁	W - ако е победител получава 2000 точки
# ⦁	F - ако е финалист получава 1200 точки
# ⦁	SF - ако е полуфиналист получава 720 точки
# Напишете програма, която изчислява колко ще са точките на Григор след изиграване на всички турнири, като знаете с колко точки стартира сезона. Също изчислете колко точки средно печели от всички изиграни турнири и колко процента от турнирите е спечелил.
# Вход
# От конзолата първо се четат два реда:
# ⦁	Брой турнири, в които е участвал – цяло число в интервала [1…20]
# ⦁	Начален брой точки в ранглистата - цяло число в интервала [1...4000]
# За всеки турнир се прочита отделен ред:
# ⦁	Достигнат етап от турнира – текст – "W", "F" или "SF"
# Изход
# Отпечатват се три реда в следния формат:
# ⦁	"Final points: {брой точки след изиграните турнири}"
# ⦁	"Average points: {средно колко точки печели за турнир}"
# ⦁	"{процент спечелени турнири}%"
# Средните точки да бъдат закръглени към най-близкото цяло число надолу, а процентът да се форматира до втората цифра след десетичния знак.

import math

tournament_num = int(input())
starting_points = int(input())
points = 0
win = 0

for i in range(tournament_num):
    tournament_phase = str(input())
    if tournament_phase == "W":
        points += 2000
        win += 1
    elif tournament_phase == "F":
        points += 1200
    elif tournament_phase == "SF":
        points += 720

print(f"Final points: {(points + starting_points)}")
print(f"Average points: {math.floor(points / tournament_num)}")
print(f"{win / tournament_num * 100:.2f}%")